# Brewfile

# Core
brew "neovim"
brew "tree-sitter"
brew "tmux"
brew "git"
brew "make"

# Languages
brew "go"
brew "python@3.12"
brew "terraform"
brew "node"

# Tools
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "starship"
brew "bat"
brew "btop"
brew "eza"
brew "jq"
brew "yq"
brew "luarocks"

# Formatters & Linters
brew "stylua"
brew "prettier"
brew "gofumpt"
brew "golangci-lint"
brew "black"
brew "isort"
brew "actionlint"
brew "ansible-lint"
brew "yamllint"
brew "shellcheck"

# Casks
cask "ghostty"
